## Week 11b: SQLite and Pandas

In [14]:
import sqlite3
import pandas as pd

#### Establish a connection

In [15]:
conn = sqlite3.connect("pd_students.db") #, autocommit=False)
cur = conn.cursor()

#### Read in data

In [16]:
df = pd.read_csv("students_1.csv")
df.head()

      fname     lname      ID
0   Patrick     Ramos  387423
1    Walter      King  657953
2  Margaret    Brooks  264676
3     Betty    Murphy  705400
4    Pamela  Campbell  399844

### Send data to database

In [17]:
df.to_sql('pd_students', conn, if_exists="append", index=False)

10

In [18]:
rows = cur.execute("SELECT * FROM pd_students").fetchall()
rows

[('Patrick', 'Ramos', 387423),
 ('Walter', 'King', 657953),
 ('Margaret', 'Brooks', 264676),
 ('Betty', 'Murphy', 705400),
 ('Pamela', 'Campbell', 399844),
 ('Victoria', 'Lee', 669408),
 ('Samantha', 'Peterson', 211134),
 ('Judith', 'Mendoza', 518833),
 ('Emily', 'Reed', 962205),
 ('Justin', 'Kelly', 660198),
 ('Patrick', 'Ramos', 387423),
 ('Walter', 'King', 657953),
 ('Margaret', 'Brooks', 264676),
 ('Betty', 'Murphy', 705400),
 ('Pamela', 'Campbell', 399844),
 ('Victoria', 'Lee', 669408),
 ('Samantha', 'Peterson', 211134),
 ('Judith', 'Mendoza', 518833),
 ('Emily', 'Reed', 962205),
 ('Justin', 'Kelly', 660198)]

#### Commit and close

In [19]:
conn.commit()
conn.close()

### Exercise

- Add the `students_2.csv` data to the `pd_students table` using the `if_exists` optional parameter of `to_sql()`